{
    "constitution": {
        "title": "日本国憲法",
        "sections": [
            {
                "section": 0,
                "title": "前文",
                "articles": [
                    {
                        "article": 0,
                        "paragraphs": [
                            "日本国民は、正当に<span>選挙</span>された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び<span>戦争</span>の惨禍が起ることのないやうにすることを決意し、ここに<span>主権</span>が国民に存することを宣言し、この憲法を確定する。そもそも国政は、国民の厳粛な信託によるものであつて、その権威は国民に由来し、その権力は国民の代表者がこれを行使し、その福利は国民がこれを享受する。これは人類普遍の原理であり、この憲法は、かかる原理に基くものである。われらは、これに反する一切の憲法、法令及び詔勅を排除する。\n日本国民は、恒久の<span>平和</span>を念願し、人間相互の関係を支配する崇高な理想を深く自覚するのであつて、<span>平和</span>を愛する諸国民の公正と信義に信頼して、われらの安全と生存を保持しようと決意した。われらは、<span>平和</span>を維持し、専制と隷従、圧迫と偏狭を地上から永遠に除去しようと努めてゐる国際社会において、名誉ある地位を占めたいと思ふ。われらは、全世界の国民が、ひとしく恐怖と欠乏から免かれ、<span>平和</span>のうちに生存する権利を有することを確認する。\nわれらは、いづれの国家も、自国のことのみに専念して他国を無視してはならないのであつて、政治道徳の法則は、普遍的なものであり、この法則に従ふことは、自国の<span>主権</span>を維持し、他国と対等関係に立たうとする各国の責務であると信ずる。\n日本国民は、国家の名誉にかけ、全力をあげてこの崇高な理想と目的を達成することを誓ふ。"
                        ]
                    }
                ]
            },
            {
                "section": 1,
                "title": "天皇",
                "articles": [
                    {
                        "article": 1,
                        "summary": "天皇の地位と主権在民",
                        "paragraphs": [
                            "天皇は、日本国の<span>象徴</span>であり日本国民統合の象徴であつて、この地位は、<span>主権</span>の存する日本国民の総意に基く。"
                        ]
                    },
                    {
                        "article": 3,
                        "summary": "内閣の助言と承認及び責任",
                        "paragraphs": [
                            "天皇の国事に関するすべての行為には、<span>内閣</span>の助言と承認を必要とし、<span>内閣</span>が、その責任を負ふ。"
                        ]
                    },
                    {
                        "article": 6,
                        "summary": "天皇の任命行為",
                        "paragraphs": [
                            "天皇は、<span>国会</span>の指名に基いて、内閣総理大臣を<span>任命</span>する。",
                            "天皇は、<span>内閣</span>の指名に基いて、最高裁判所の長たる裁判官を<span>任命</span>する。"
                        ]
                    }
                ]
            },
            {
                "section": 2,
                "title": "戦争の放棄",
                "articles": [
                    {
                        "article": 9,
                        "summary": "戦争の放棄と戦力及び交戦権の否認",
                        "paragraphs": [
                            "日本国民は、正義と秩序を基調とする国際平和を誠実に希求し、国権の発動たる<span>戦争</span>と、<span>武力</span>による威嚇又は<span>武力</span>の行使は、国際紛争を解決する手段としては、永久にこれを<span>放棄</span>する。",
                            "前項の目的を達するため、陸海空軍その他の<span>戦力</span>は、これを保持しない。国の<span>交戦権</span>は、これを認めない。"
                        ]
                    }
                ]
            },
            {
                "section": 3,
                "title": "国民の権利及び義務",
                "articles": [
                    {
                        "article": 11,
                        "summary": "基本的人権",
                        "paragraphs": [
                            "国民は、すべての基本的人権の享有を妨げられない。この憲法が国民に保障する基本的人権は、侵すことのできない<span>永久</span>の権利として、現在及び将来の国民に与へられる。"
                        ]
                    },
                    {
                        "article": 12,
                        "summary": "自由及び権利の保持義務と公共福祉性",
                        "paragraphs": [
                            "この憲法が国民に保障する自由及び権利は、国民の不断の努力によつて、これを保持しなければならない。又、国民は、これを濫用してはならないのであつて、常に<span>公共の福祉</span>のためにこれを利用する責任を負ふ。"
                        ]
                    },
                    {
                        "article": 14,
                        "summary": "平等原則、貴族制度の否認及び栄典の限界",
                        "paragraphs": [
                            "すべて国民は、法の<span>下</span>に<span>平等</span>であつて、人種、信条、<span>性別</span>、社会的身分又は門地により、政治的、経済的又は社会的関係において、<span>差別</span>されない。",
                            "華族その他の貴族の制度は、これを認めない。",
                            "栄誉、勲章その他の栄典の授与は、いかなる特権も伴はない。栄典の授与は、現にこれを有し、又は将来これを受ける者の一代に限り、その効力を有する。"
                        ]
                    },
                    {
                        "article": 15,
                        "summary": "公務員の選定罷免権、公務員の本質、普通選挙の保障及び投票秘密の保障",
                        "paragraphs": [
                            "公務員を選定し、及びこれを罷免することは、国民固有の権利である。",
                            "すべて公務員は、<span>全体</span>の奉仕者であつて、<span>一部</span>の奉仕者ではない。",
                            "公務員の選挙については、成年者による普通選挙を保障する。",
                            "すべて選挙における投票の秘密は、これを侵してはならない。選挙人は、その選択に関し公的にも私的にも責任を問はれない。"
                        ]
                    },
                    {
                        "article": 19,
                        "summary": "思想及び良心の自由",
                        "paragraphs": [
                            "<span>思想</span>及び良心の自由は、これを侵してはならない。"
                        ]
                    },
                    {
                        "article": 20,
                        "summary": "信教の自由",
                        "paragraphs": [
                            "<span>信教</span>の自由は、何人に対してもこれを保障する。いかなる宗教団体も、国から特権を受け、又は政治上の権力を行使してはならない。",
                            "何人も、宗教上の行為、祝典、儀式又は行事に参加することを強制されない。",
                            "国及びその機関は、宗教教育その他いかなる宗教的活動もしてはならない。"
                        ]
                    },
                    {
                        "article": 21,
                        "summary": "集会、結社及び表現の自由と通信秘密の保護",
                        "paragraphs": [
                            "集会、結社及び言論、出版その他一切の<span>表現</span>の自由は、これを保障する。",
                            "検閲は、これをしてはならない。通信の秘密は、これを侵してはならない。"
                        ]
                    },
                    {
                        "article": 22,
                        "summary": "居住、移転、職業選択、外国移住及び国籍離脱の自由",
                        "paragraphs": [
                            "何人も、<span>公共の福祉</span>に反しない限り、居住、移転及び<span>職業選択</span>の自由を有する。",
                            "何人も、外国に移住し、又は国籍を離脱する自由を侵されない。"
                        ]
                    },
                    {
                        "article": 24,
                        "summary": "家族関係における個人の尊厳と両性の平等",
                        "paragraphs": [
                            "婚姻は、<span>両性</span>の合意のみに基いて成立し、夫婦が同等の権利を有することを基本として、相互の協力により、維持されなければならない。",
                            "配偶者の選択、財産権、相続、住居の選定、離婚並びに婚姻及び家族に関するその他の事項に関しては、法律は、個人の尊厳と<span>両性</span>の本質的<span>平等</span>に立脚して、制定されなければならない。"
                        ]
                    },
                    {
                        "article": 25,
                        "summary": "生存権及び国民生活の社会的進歩向上に努める国の義務",
                        "paragraphs": [
                            "すべて国民は、<span>健康で文化的</span>な<span>最低限度</span>の生活を営む権利を有する。",
                            "国は、すべての生活部面について、社会福祉、社会保障及び公衆衛生の向上及び増進に努めなければならない。"
                        ]
                    },
                    {
                        "article": 26,
                        "summary": "教育を受ける権利と受けさせる義務",
                        "paragraphs": [
                            "すべて国民は、法律の定めるところにより、その能力に応じて、ひとしく<span>教育</span>を受ける権利を有する。",
                            "すべて国民は、法律の定めるところにより、その保護する子女に普通<span>教育</span>を受けさせる義務を負ふ。<span>義務教育</span>は、これを無償とする。"
                        ]
                    },
                    {
                        "article": 27,
                        "summary": "勤労の権利と義務、勤労条件の基準及び児童酷使の禁止",
                        "paragraphs": [
                            "すべて国民は、<span>勤労</span>の権利を有し、義務を負ふ。",
                            "賃金、就業時間、休息その他の<span>勤労</span>条件に関する基準は、法律でこれを定める。",
                            "児童は、これを酷使してはならない。"
                        ]
                    },
                    {
                        "article": 30,
                        "summary": "納税の義務",
                        "paragraphs": [
                            "国民は、法律の定めるところにより、<span>納税</span>の義務を負ふ。"
                        ]
                    },
                    {
                        "article": 32,
                        "summary": "裁判を受ける権利",
                        "paragraphs": [
                            "何人も、裁判所において<span>裁判</span>を受ける権利を奪はれない。"
                        ]
                    }
                ]
            },
            {
                "section": 4,
                "title": "国会",
                "articles": [
                    {
                        "article": 41,
                        "summary": "国会の地位",
                        "paragraphs": [
                            "国会は、国権の<span>最高機関</span>であつて、国の唯一の<span>立法機関</span>である。"
                        ]
                    },
                    {
                        "article": 45,
                        "summary": "衆議院議員の任期",
                        "paragraphs": [
                            "衆議院議員の任期は、<span>四年</span>とする。但し、衆議院<span>解散</span>の場合には、その期間満了前に終了する。"
                        ]
                    },
                    {
                        "article": 46,
                        "summary": "参議院議員の任期",
                        "paragraphs": [
                            "参議院議員の任期は、<span>六年</span>とし、<span>三年</span>ごとに議員の半数を改選する。"
                        ]
                    },
                    {
                        "article": 53,
                        "summary": "臨時会",
                        "paragraphs": [
                            "内閣は、国会の臨時会の召集を決定することができる。いづれかの議院の総議員の<span>四分の一</span>以上の要求があれば、内閣は、その召集を決定しなければならない。"
                        ]
                    },
                    {
                        "article": 54,
                        "summary": "総選挙、特別会及び緊急集会",
                        "paragraphs": [
                            "衆議院が<span>解散</span>されたときは、<span>解散</span>の日から<span>四十日</span>以内に、衆議院議員の総選挙を行ひ、その選挙の日から<span>三十日</span>以内に、国会を召集しなければならない。",
                            "衆議院が<span>解散</span>されたときは、参議院は、同時に閉会となる。但し、内閣は、国に緊急の必要があるときは、参議院の緊急集会を求めることができる。",
                            "前項但書の緊急集会において採られた措置は、臨時のものであつて、次の国会開会の後十日以内に、衆議院の同意がない場合には、その効力を失ふ。"
                        ]
                    },
                    {
                        "article": 56,
                        "summary": "議事の定足数と過半数議決",
                        "paragraphs": [
                            "両議院は、各々その総議員の<span>三分の一</span>以上の出席がなければ、議事を開き議決することができない。",
                            "両議院の議事は、この憲法に特別の定のある場合を除いては、出席議員の<span>過半数</span>でこれを決し、可否同数のときは、議長の決するところによる。"
                        ]
                    },
                    {
                        "article": 59,
                        "summary": "法律の成立",
                        "paragraphs": [
                            "法律案は、この憲法に特別の定のある場合を除いては、両議院で可決したとき法律となる。",
                            "衆議院で可決し、参議院でこれと異なつた議決をした法律案は、衆議院で出席議員の<span>三分の二</span>以上の多数で再び可決したときは、法律となる。",
                            "前項の規定は、法律の定めるところにより、衆議院が、両議院の協議会を開くことを求めることを妨げない。",
                            "参議院が、衆議院の可決した法律案を受け取つた後、国会休会中の期間を除いて<span>六十日</span>以内に、議決しないときは、衆議院は、参議院がその法律案を否決したものとみなすことができる。"
                        ]
                    },
                    {
                        "article": 60,
                        "summary": "衆議院の予算先議権及び予算の議決",
                        "paragraphs": [
                            "予算は、さきに衆議院に提出しなければならない。",
                            "予算について、参議院で衆議院と異なつた議決をした場合に、法律の定めるところにより、両議院の協議会を開いても意見が一致しないとき、又は参議院が、衆議院の可決した予算を受け取つた後、国会休会中の期間を除いて三十日以内に、議決しないときは、衆議院の議決を国会の議決とする。"
                        ]
                    },
                    {
                        "article": 64,
                        "summary": "弾劾裁判所",
                        "paragraphs": [
                            "国会は、罷免の訴追を受けた裁判官を裁判するため、両議院の議員で組織する<span>弾劾裁判所</span>を設ける。",
                            "<span>弾劾</span>に関する事項は、法律でこれを定める。"
                        ]
                    }
                ]
            },
            {
                "section": 5,
                "title": "内閣",
                "articles": [
                    {
                        "article": 65,
                        "summary": "行政権の帰属",
                        "paragraphs": [
                            "<span>行政権</span>は、内閣に属する。"
                        ]
                    },
                    {
                        "article": 66,
                        "summary": "内閣の組織と責任",
                        "paragraphs": [
                            "内閣は、法律の定めるところにより、その首長たる内閣総理大臣及びその他の国務大臣でこれを組織する。",
                            "内閣総理大臣その他の国務大臣は、<span>文民</span>でなければならない。",
                            "内閣は、<span>行政権</span>の行使について、国会に対し<span>連帯</span>して責任を負ふ。"
                        ]
                    },
                    {
                        "article": 67,
                        "summary": "内閣総理大臣の指名",
                        "paragraphs": [
                            "内閣総理大臣は、国会議員の中から国会の議決で、これを<span>指名</span>する。この<span>指名</span>は、他のすべての案件に先だつて、これを行ふ。",
                            "衆議院と参議院とが異なつた<span>指名</span>の議決をした場合に、法律の定めるところにより、両議院の協議会を開いても意見が一致しないとき、又は衆議院が<span>指名</span>の議決をした後、国会休会中の期間を除いて<span>十日</span>以内に、参議院が、<span>指名</span>の議決をしないときは、衆議院の議決を国会の議決とする。"
                        ]
                    },
                    {
                        "article": 68,
                        "summary": "国務大臣の任免",
                        "paragraphs": [
                            "内閣総理大臣は、国務大臣を<span>任命</span>する。但し、その過半数は、国会議員の中から選ばれなければならない。",
                            "内閣総理大臣は、任意に国務大臣を罷免することができる。"
                        ]
                    },
                    {
                        "article": 69,
                        "summary": "不信任決議と解散又は総辞職",
                        "paragraphs": [
                            "内閣は、衆議院で<span>不信任</span>の決議案を可決し、又は信任の決議案を否決したときは、<span>十日</span>以内に衆議院が<span>解散</span>されない限り、総辞職をしなければならない。"
                        ]
                    }
                ]
            },
            {
                "section": 6,
                "title": "司法",
                "articles": [
                    {
                        "article": 76,
                        "summary": "司法権の機関と裁判官の職務上の独立",
                        "paragraphs": [
                            "すべて<span>司法権</span>は、最高裁判所及び法律の定めるところにより設置する下級裁判所に属する。",
                            "特別裁判所は、これを設置することができない。行政機関は、終審として裁判を行ふことができない。",
                            "すべて裁判官は、その<span>良心</span>に従ひ<span>独立</span>してその職権を行ひ、この<span>憲法</span>及び法律にのみ拘束される。"
                        ]
                    },
                    {
                        "article": 78,
                        "summary": "裁判官の身分の保障",
                        "paragraphs": [
                            "裁判官は、裁判により、<span>心身</span>の故障のために職務を執ることができないと決定された場合を除いては、公の<span>弾劾</span>によらなければ罷免されない。裁判官の懲戒処分は、行政機関がこれを行ふことはできない。"
                        ]
                    },
                    {
                        "article": 81,
                        "summary": "最高裁判所の法令審査権",
                        "paragraphs": [
                            "最高裁判所は、一切の法律、命令、規則又は処分が<span>憲法</span>に適合するかしないかを決定する権限を有する終審裁判所である。"
                        ]
                    }
                ]
            },
            {
                "section": 9,
                "title": "改正",
                "articles": [
                    {
                        "article": 96,
                        "summary": "憲法改正の発議、国民投票及び公布",
                        "paragraphs": [
                            "この憲法の改正は、各議院の総議員の<span>三分の二</span>以上の賛成で、国会が、これを<span>発議</span>し、国民に提案してその承認を経なければならない。この承認には、特別の<span>国民投票</span>又は国会の定める選挙の際行はれる投票において、その<span>過半数</span>の賛成を必要とする。",
                            "憲法改正について前項の承認を経たときは、天皇は、国民の名で、この憲法と一体を成すものとして、直ちにこれを公布する。"
                        ]
                    }
                ]
            },
            {
                "section": 10,
                "title": "最高法規",
                "articles": [
                    {
                        "article": 97,
                        "summary": "基本的人権の由来特質",
                        "paragraphs": [
                            "この憲法が日本国民に保障する<span>基本的人権</span>は、人類の多年にわたる自由獲得の努力の成果であつて、これらの権利は、過去幾多の試錬に堪へ、現在及び将来の国民に対し、侵すことのできない<span>永久</span>の権利として信託されたものである。"
                        ]
                    },
                    {
                        "article": 98,
                        "summary": "憲法の最高性と条約及び国際法規の遵守",
                        "paragraphs": [
                            "この憲法は、国の<span>最高法規</span>であつて、その条規に反する法律、命令、詔勅及び国務に関するその他の行為の全部又は一部は、その効力を有しない。",
                            "日本国が締結した条約及び確立された国際法規は、これを誠実に遵守することを必要とする。"
                        ]
                    },
                    {
                        "article": 99,
                        "summary": "憲法尊重擁護の義務",
                        "paragraphs": [
                            "天皇又は摂政及び国務大臣、<span>国会議員</span>、裁判官その他の公務員は、この憲法を尊重し擁護する義務を負ふ。"
                        ]
                    }
                ]
            }
        ]
    }
}